apache/nuttx/arch/arm/src/stm32f7/stm32_otghost.c
  /* Check for Port Connect DETected (PCDET).  The core sets this bit when a
   * device connection is detected.
   */

  if ((hprt & OTG_HPRT_PCDET) != 0)
    {
      /* Set up to clear the PCDET status in the new HPRT contents. Then
       * process the new connection event.
       */

      usbhost_vtrace1(OTG_VTRACE1_GINT_HPRT_PCDET, 0);
      newhprt |= OTG_HPRT_PCDET;
      stm32_portreset(priv);
      stm32_gint_connected(priv);
    }

  /* Check for Port Enable CHaNGed (PENCHNG) */

  if ((hprt & OTG_HPRT_PENCHNG) != 0)
    {
      /* Set up to clear the PENCHNG status in the new HPRT contents. */

      usbhost_vtrace1(OTG_VTRACE1_GINT_HPRT_PENCHNG, 0);
      newhprt |= OTG_HPRT_PENCHNG;

      /* Was the port enabled? */

      if ((hprt & OTG_HPRT_PENA) != 0)
        {
          /* Yes.. handle the new connection event */

          stm32_gint_connected(priv);

          /* Check the Host ConFiGuration register (HCFG) */

          hcfg = stm32_getreg(STM32_OTG_HCFG);

          /* Is this a low speed or full speed connection (OTG FS does not
           * support high speed)
           */

          if ((hprt & OTG_HPRT_PSPD_MASK) == OTG_HPRT_PSPD_LS)
            {
              /* Set the Host Frame Interval Register for the 6KHz speed */

              usbhost_vtrace1(OTG_VTRACE1_GINT_HPRT_LSDEV, 0);
              stm32_putreg(STM32_OTG_HFIR, 6000);

              /* Are we switching from FS to LS? */

              if ((hcfg & OTG_HCFG_FSLSPCS_MASK) != OTG_HCFG_FSLSPCS_LS6MHz)
                {
                  usbhost_vtrace1(OTG_VTRACE1_GINT_HPRT_FSLSSW, 0);

                  /* Yes... configure for LS */

                  hcfg &= ~OTG_HCFG_FSLSPCS_MASK;
                  hcfg |= OTG_HCFG_FSLSPCS_LS6MHz;
                  stm32_putreg(STM32_OTG_HCFG, hcfg);

                  /* And reset the port */

                  stm32_portreset(priv);
                }
            }
          else /* if ((hprt & OTG_HPRT_PSPD_MASK) == OTG_HPRT_PSPD_FS) */
            {
              usbhost_vtrace1(OTG_VTRACE1_GINT_HPRT_FSDEV, 0);
              stm32_putreg(STM32_OTG_HFIR, 48000);

              /* Are we switching from LS to FS? */

              if ((hcfg & OTG_HCFG_FSLSPCS_MASK) != OTG_HCFG_FSLSPCS_FS48MHz)
                {
                  usbhost_vtrace1(OTG_VTRACE1_GINT_HPRT_LSFSSW, 0);

                  /* Yes... configure for FS */

                  hcfg &= ~OTG_HCFG_FSLSPCS_MASK;
                  hcfg |= OTG_HCFG_FSLSPCS_FS48MHz;
                  stm32_putreg(STM32_OTG_HCFG, hcfg);

                  /* And reset the port */

                  stm32_portreset(priv);
                }
            }
        }
    }

  /* Clear port interrupts by setting bits in the HPRT */

  stm32_putreg(STM32_OTG_HPRT, newhprt);
}

/****************************************************************************
 * Name: stm32_gint_discisr
 *
 * Description:
 *   USB OTG FS disconnect detected interrupt handler
 *
 ****************************************************************************/

static inline void stm32_gint_discisr(struct stm32_usbhost_s *priv)
{
  /* Handle the disconnection event */

  stm32_gint_disconnected(priv);

  /* Clear the dicsonnect interrupt */

  stm32_putreg(STM32_OTG_GINTSTS, OTG_GINT_DISC);
}

/****************************************************************************
 * Name: stm32_gint_ipxfrisr
 *
 * Description:
 *   USB OTG FS incomplete periodic interrupt handler
 *
 ****************************************************************************/

static inline void stm32_gint_ipxfrisr(struct stm32_usbhost_s *priv)
{
  uint32_t regval;

  /* CHENA : Set to enable the channel
   * CHDIS : Set to stop transmitting/receiving data on a channel
   */

  regval = stm32_getreg(STM32_OTG_HCCHAR(0));
  regval |= (OTG_HCCHAR_CHDIS | OTG_HCCHAR_CHENA);
  stm32_putreg(STM32_OTG_HCCHAR(0), regval);

  /* Clear the incomplete isochronous OUT interrupt */

  stm32_putreg(STM32_OTG_GINTSTS, OTG_GINT_IPXFR);
}

/****************************************************************************
 * Name: stm32_gint_isr
 *
 * Description:
 *   USB OTG global interrupt handler
 *
 ****************************************************************************/

static int stm32_gint_isr(int irq, void *context, void *arg)
{
  /* At present, there is only support for a single OTG host. Hence it is
   * pre-allocated as g_usbhost.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct stm32_usbhost_s *priv = &g_usbhost;
  uint32_t pending;

  /* If OTG were supported, we would need to check if we are in host or
   * device mode when the global interrupt occurs.  Here we support only
   * host mode
   */

  /* Loop while there are pending interrupts to process.  This loop may save
   * a little interrupt handling overhead.
   */

  for (; ; )
    {
      /* Get the unmasked bits in the GINT status */

      pending  = stm32_getreg(STM32_OTG_GINTSTS);
      pending &= stm32_getreg(STM32_OTG_GINTMSK);

      /* Return from the interrupt when there are no further pending
       * interrupts.
       */

      if (pending == 0)
        {
          return OK;
        }

      /* Otherwise, process each pending, unmasked GINT interrupts */

      /* Handle the start of frame interrupt */

#ifdef CONFIG_STM32_OTG_SOFINTR
      if ((pending & OTG_GINT_SOF) != 0)
        {
          usbhost_vtrace1(OTG_VTRACE1_GINT_SOF, 0);
          stm32_gint_sofisr(priv);
        }
#endif

      /* Handle the RxFIFO non-empty interrupt */

      if ((pending & OTG_GINT_RXFLVL) != 0)
        {
          usbhost_vtrace1(OTG_VTRACE1_GINT_RXFLVL, 0);
          stm32_gint_rxflvlisr(priv);
        }

      /* Handle the non-periodic TxFIFO empty interrupt */

      if ((pending & OTG_GINT_NPTXFE) != 0)
        {
          usbhost_vtrace1(OTG_VTRACE1_GINT_NPTXFE, 0);
          stm32_gint_nptxfeisr(priv);
        }

